Repository: swiftwave2023/OneStep
Catalog: OneStep/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, fr, hi, it, ja

source: Default Search Engine
ar: محرك البحث الافتراضي
fr: Moteur de recherche par défaut
hi: डिफ़ॉल्ट खोज इंजन
it: Motore di ricerca predefinito
ja: デフォルトの検索エンジン

source: Bookmarks
ar: الإشارات المرجعية
fr: Signets
hi: बुकमार्क
it: Segnalibri
ja: ブックマーク

source: No bookmarks added yet.
ar: لم تتم إضافة إشارات مرجعية بعد.
fr: Aucun signet ajouté pour l'instant.
hi: अभी तक कोई बुकमार्क नहीं जोड़ा गया।
it: Nessun segnalibro aggiunto ancora.
ja: ブックマークはまだ追加されていません。

source: You can use /web command to search your bookmarks quickly.
ar: يمكنك استخدام الأمر /web للبحث في إشاراتك المرجعية بسرعة.
fr: Vous pouvez utiliser la commande /web pour rechercher rapidement dans vos signets.
hi: आप अपने बुकमार्क को जल्दी से खोजने के लिए /web कमांड का उपयोग कर सकते हैं।
it: Puoi usare il comando /web per cercare rapidamente nei tuoi segnalibri.
ja: /web コマンドを使用して、ブックマークをすばやく検索できます。

source: Add New Bookmark
ar: إضافة إشارة مرجعية جديدة
fr: Ajouter un nouveau signet
hi: नया बुकमार्क जोड़ें
it: Aggiungi nuovo segnalibro
ja: 新しいブックマークを追加

source: Title
ar: العنوان
fr: Titre
hi: शीर्षक
it: Titolo
ja: タイトル

source: URL
ar: الرابط
hi: यूआरएल

source: Cancel
ar: إلغاء
fr: Annuler
hi: रद्द करें
it: Annulla
ja: キャンセル

source: Add
ar: إضافة
fr: Ajouter
hi: जोड़ें
it: Aggiungi
ja: 追加

source: Web Search
ar: بحث الويب
fr: Recherche Web
hi: वेब खोज
it: Ricerca Web
ja: ウェブ検索

source: File Search
ar: بحث الملفات
fr: Recherche de fichiers
hi: फ़ाइल खोज
it: Ricerca File
ja: ファイル検索

source: General
ar: عام
fr: Général
hi: सामान्य
it: Generale
ja: 一般

source: IAP
ar: عمليات الشراء داخل التطبيق
fr: Achats intégrés
hi: इन-ऐप खरीदारी
it: Acquisti in-app
ja: アプリ内課金

source: Contact Us
ar: اتصل بنا
fr: Contactez-nous
hi: संपर्क करें
it: Contattaci
ja: お問い合わせ

source: Rate Us
ar: قيمنا
fr: Notez-nous
hi: हमें रेट करें
it: Valutaci
ja: 評価する

source: File Search Scopes
ar: نطاقات بحث الملفات
fr: Portées de recherche de fichiers
hi: फ़ाइल खोज क्षेत्र
it: Ambiti di ricerca file
ja: ファイル検索範囲

source: Add folders to include in file search results (use /files command).
ar: أضف مجلدات لتضمينها في نتائج بحث الملفات (استخدم الأمر /files).
fr: Ajoutez des dossiers à inclure dans les résultats de recherche de fichiers (utilisez la commande /files).
hi: फ़ाइल खोज परिणामों में शामिल करने के लिए फ़ोल्डर जोड़ें (/files कमांड का उपयोग करें)।
it: Aggiungi cartelle da includere nei risultati della ricerca file (usa il comando /files).
ja: ファイル検索結果に含めるフォルダを追加します（/files コマンドを使用）。

source: No Search Scopes
ar: لا توجد نطاقات بحث
fr: Aucune portée de recherche
hi: कोई खोज क्षेत्र नहीं
it: Nessun ambito di ricerca
ja: 検索範囲なし

source: Add folders to start searching files.
ar: أضف مجلدات لبدء البحث في الملفات.
fr: Ajoutez des dossiers pour commencer la recherche de fichiers.
hi: फ़ाइलें खोजना शुरू करने के लिए फ़ोल्डर जोड़ें।
it: Aggiungi cartelle per iniziare a cercare file.
ja: フォルダを追加してファイルの検索を開始します。

source: Add Folder
ar: إضافة مجلد
fr: Ajouter un dossier
hi: फ़ोल्डर जोड़ें
it: Aggiungi cartella
ja: フォルダを追加

source: Reset to Defaults
ar: إعادة تعيين إلى الافتراضيات
fr: Rétablir les paramètres par défaut
hi: डिफ़ॉल्ट पर रीसेट करें
it: Ripristina predefiniti
ja: デフォルトにリセット

source: Search Web for '%@'
ar: بحث في الويب عن '%@'
fr: Rechercher sur le Web pour '%@'
hi: '%@' के लिए वेब खोजें
it: Cerca sul Web '%@'
ja: '%@' をウェブで検索

source: Using %@
ar: باستخدام %@
fr: Utilisation de %@
hi: %@ का उपयोग करना
it: Uso di %@
ja: %@ を使用

source: Search apps...
ar: البحث عن التطبيقات...
fr: Rechercher des applications...
hi: ऐप्स खोजें...
it: Cerca app...
ja: アプリを検索...

source: Search or type / for commands…
ar: ابحث أو اكتب / للأوامر...
fr: Rechercher ou taper / pour les commandes…
hi: खोजें या कमांड के लिए / टाइप करें…
it: Cerca o digita / per i comandi…
ja: 検索またはコマンドのために / を入力...

source: No matching apps
ar: لا توجد تطبيقات مطابقة
fr: Aucune application correspondante
hi: कोई मेल खाते ऐप्स नहीं
it: Nessuna app corrispondente
ja: 一致するアプリはありません

source: Type to search files
ar: اكتب للبحث في الملفات
fr: Tapez pour rechercher des fichiers
hi: फ़ाइलें खोजने के लिए टाइप करें
it: Digita per cercare file
ja: 入力してファイルを検索

source: No matching commands
ar: لا توجد أوامر مطابقة
fr: Aucune commande correspondante
hi: कोई मेल खाते कमांड नहीं
it: Nessun comando corrispondente
ja: 一致するコマンドはありません

source: No results
ar: لا توجد نتائج
fr: Aucun résultat
hi: कोई परिणाम नहीं
it: Nessun risultato
ja: 結果なし

source: Type / to see available commands
ar: اكتب / لرؤية الأوامر المتاحة
fr: Tapez / pour voir les commandes disponibles
hi: उपलब्ध कमांड देखने के लिए / टाइप करें
it: Digita / per vedere i comandi disponibili
ja: / を入力して利用可能なコマンドを表示

source: Try different keywords or type / for commands
ar: جرب كلمات مفتاحية مختلفة أو اكتب / للأوامر
fr: Essayez différents mots-clés ou tapez / pour les commandes
hi: विभिन्न कीवर्ड आज़माएं या कमांड के लिए / टाइप करें
it: Prova parole chiave diverse o digita / per i comandi
ja: 別のキーワードを試すか、コマンドのために / を入力してください

source: Show all apps
ar: عرض جميع التطبيقات
fr: Afficher toutes les applications
hi: सभी ऐप्स दिखाएं
it: Mostra tutte le app
ja: すべてのアプリを表示

source: Search files
ar: بحث الملفات
fr: Rechercher des fichiers
hi: फ़ाइलें खोजें
it: Cerca file
ja: ファイルを検索

source: Web search & bookmarks
ar: بحث الويب والإشارات المرجعية
fr: Recherche Web et signets
hi: वेब खोज और बुकमार्क
it: Ricerca Web e segnalibri
ja: ウェブ検索とブックマーク

source: Open Settings
ar: فتح الإعدادات
fr: Ouvrir les paramètres
hi: सेटिंग्स खोलें
it: Apri Impostazioni
ja: 設定を開く

source: Quit OneStep
ar: إنهاء OneStep
fr: Quitter OneStep
hi: OneStep छोड़ें
it: Esci da OneStep
ja: OneStep を終了

source: Shortcuts
ar: الاختصارات
fr: Raccourcis
hi: शॉर्टकट
it: Scorciatoie
ja: ショートカット

source: Show Dock Icon
ar: إظهار أيقونة Dock
fr: Afficher l'icône du Dock
hi: डॉक आइकन दिखाएं
it: Mostra icona nel Dock
ja: Dock アイコンを表示

source: Show Menu Bar Icon
ar: إظهار أيقونة شريط القوائم
fr: Afficher l'icône de la barre des menus
hi: मेनू बार आइकन दिखाएं
it: Mostra icona nella barra dei menu
ja: メニューバーアイコンを表示

source: Appearance
ar: المظهر
fr: Apparence
hi: दिखावट
it: Aspetto
ja: 外観

source: Enhanced Search
ar: بحث محسن
fr: Recherche améliorée
hi: उन्नत खोज
it: Ricerca avanzata
ja: 拡張検索

source: Search deeper into your system.
ar: ابحث بعمق في نظامك.
fr: Recherchez plus profondément dans votre système.
hi: अपने सिस्टम में गहराई से खोजें।
it: Cerca più a fondo nel tuo sistema.
ja: システムをより深く検索します。

source: Advanced Commands
ar: أوامر متقدمة
fr: Commandes avancées
hi: उन्नत कमांड
it: Comandi avanzati
ja: 高度なコマンド

source: Execute system commands directly.
ar: نفذ أوامر النظام مباشرة.
fr: Exécutez directement les commandes système.
hi: सीधे सिस्टम कमांड निष्पादित करें।
it: Esegui direttamente i comandi di sistema.
ja: システムコマンドを直接実行します。

source: Priority Support
ar: دعم ذو أولوية
fr: Support prioritaire
hi: प्राथमिकता समर्थन
it: Supporto prioritario
ja: 優先サポート

source: Get priority support for any issues.
ar: احصل على دعم ذو أولوية لأي مشاكل.
fr: Obtenez un support prioritaire pour tout problème.
hi: किसी भी समस्या के लिए प्राथमिकता समर्थन प्राप्त करें।
it: Ottieni supporto prioritario per qualsiasi problema.
ja: あらゆる問題に対して優先的なサポートを受けられます。

source: More Features Coming Soon
ar: المزيد من الميزات قريبا
fr: Plus de fonctionnalités à venir
hi: और सुविधाएँ जल्द ही आ रही हैं
it: Altre funzionalità in arrivo
ja: その他の機能も近日公開予定

source: Stay tuned for more exciting features.
ar: ترقبوا المزيد من الميزات المثيرة.
fr: Restez à l'écoute pour d'autres fonctionnalités intéressantes.
hi: अधिक रोमांचक सुविधाओं के लिए बने रहें।
it: Resta sintonizzato per altre funzionalità interessanti.
ja: さらなるエキサイティングな機能にご期待ください。

source: Import from HTML
ar: استيراد من HTML
fr: Importer depuis HTML
hi: HTML से आयात करें
it: Importa da HTML
ja: HTML からインポート

source: Export to HTML
ar: تصدير إلى HTML
fr: Exporter vers HTML
hi: HTML में निर्यात करें
it: Esporta in HTML
ja: HTML にエクスポート

source: Reset to Default Bookmarks
ar: إعادة تعيين إلى الإشارات المرجعية الافتراضية
fr: Rétablir les signets par défaut
hi: डिफ़ॉल्ट बुकमार्क पर रीसेट करें
it: Ripristina segnalibri predefiniti
ja: デフォルトのブックマークにリセット

source: Reset to Default?
ar: إعادة تعيين إلى الافتراضي؟
fr: Rétablir par défaut ?
hi: डिफ़ॉल्ट पर रीसेट करें?
it: Ripristinare predefiniti?
ja: デフォルトにリセットしますか？

source: Reset
ar: إعادة تعيين
fr: Rétablir
hi: रीसेट
it: Ripristina
ja: リセット

source: This will replace all current bookmarks with the default list.
ar: سيؤدي هذا إلى استبدال جميع الإشارات المرجعية الحالية بالقائمة الافتراضية.
fr: Cela remplacera tous les signets actuels par la liste par défaut.
hi: यह सभी मौजूदा बुकमार्क को डिफ़ॉल्ट सूची से बदल देगा।
it: Questo sostituirà tutti i segnalibri attuali con l'elenco predefinito.
ja: これにより、現在のすべてのブックマークがデフォルトのリストに置き換わります。

source: Clear All Bookmarks
ar: مسح جميع الإشارات المرجعية
fr: Effacer tous les signets
hi: सभी बुकमार्क साफ़ करें
it: Cancella tutti i segnalibri
ja: すべてのブックマークをクリア

source: Are you sure you want to clear all bookmarks?
ar: هل أنت متأكد أنك تريد مسح جميع الإشارات المرجعية؟
fr: Êtes-vous sûr de vouloir effacer tous les signets ?
hi: क्या आप वाकई सभी बुकमार्क साफ़ करना चाहते हैं?
it: Sei sicuro di voler cancellare tutti i segnalibri?
ja: すべてのブックマークをクリアしてもよろしいですか？

source: Clear All
ar: مسح الكل
fr: Tout effacer
hi: सभी साफ़ करें
it: Cancella tutto
ja: すべてクリア

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
fr: Cette action est irréversible.
hi: यह क्रिया पूर्ववत नहीं की जा सकती।
it: Questa azione non può essere annullata.
ja: この操作は取り消せません。

source: How to export bookmarks
ar: كيفية تصدير الإشارات المرجعية
fr: Comment exporter des signets
hi: बुकमार्क कैसे निर्यात करें
it: Come esportare i segnalibri
ja: ブックマークのエクスポート方法

source: Export Bookmarks Guide
ar: دليل تصدير الإشارات المرجعية
fr: Guide d'exportation des signets
hi: बुकमार्क निर्यात गाइड
it: Guida all'esportazione dei segnalibri
ja: ブックマークのエクスポートガイド

source: Follow these steps to export your bookmarks as an HTML file, then import it here.
ar: اتبع هذه الخطوات لتصدير إشاراتك المرجعية كملف HTML، ثم استوردها هنا.
fr: Suivez ces étapes pour exporter vos signets sous forme de fichier HTML, puis importez-le ici.
hi: अपने बुकमार्क को HTML फ़ाइल के रूप में निर्यात करने के लिए इन चरणों का पालन करें, फिर इसे यहां आयात करें।
it: Segui questi passaggi per esportare i tuoi segnalibri come file HTML, quindi importalo qui.
ja: 以下の手順に従ってブックマークを HTML ファイルとしてエクスポートし、ここにインポートしてください。

source: File > Export Bookmarks...
ar: ملف > تصدير الإشارات المرجعية...
fr: Fichier > Exporter les signets...
hi: फ़ाइल > बुकमार्क निर्यात करें...
it: File > Esporta segnalibri...
ja: ファイル > ブックマークをエクスポート...

source: Save the HTML file
ar: حفظ ملف HTML
fr: Enregistrer le fichier HTML
hi: HTML फ़ाइल सहेजें
it: Salva il file HTML
ja: HTML ファイルを保存

source: ⋮ Menu > Bookmarks > Bookmark Manager
ar: ⋮ القائمة > الإشارات المرجعية > مدير الإشارات المرجعية
fr: ⋮ Menu > Favoris > Gestionnaire de favoris
hi: ⋮ मेनू > बुकमार्क > बुकमार्क प्रबंधक
it: ⋮ Menu > Segnalibri > Gestione segnalibri
ja: ⋮ メニュー > ブックマーク > ブックマークマネージャ

source: ⋮ Menu (top right) > Export bookmarks
ar: ⋮ القائمة (أعلى اليمين) > تصدير الإشارات المرجعية
fr: ⋮ Menu (en haut à droite) > Exporter les favoris
hi: ⋮ मेनू (ऊपर दाएं) > बुकमार्क निर्यात करें
it: ⋮ Menu (in alto a destra) > Esporta segnalibri
ja: ⋮ メニュー (右上) > ブックマークをエクスポート

source: Favorites (⭐️) > More options (…)
ar: المفضلة (⭐️) > خيارات إضافية ( … )
fr: Favoris (⭐️) > Plus d'options (…)
hi: पसंदीदा (⭐️) > अधिक विकल्प (…)
it: Preferiti (⭐️) > Altre opzioni (…)
ja: お気に入り (⭐️) > その他のオプション (…)

source: Export favorites
ar: تصدير المفضلة
fr: Exporter les favoris
hi: पसंदीदा निर्यात करें
it: Esporta preferiti
ja: お気に入りをエクスポート

source: Bookmarks > Manage Bookmarks
ar: الإشارات المرجعية > إدارة الإشارات المرجعية
fr: Signets > Gérer les signets
hi: बुकमार्क > बुकमार्क प्रबंधित करें
it: Segnalibri > Gestisci segnalibri
ja: ブックマーク > ブックマークを管理

source: Import and Backup > Export Bookmarks to HTML...
ar: استيراد ونسخ احتياطي > تصدير الإشارات المرجعية إلى HTML...
fr: Importer et sauvegarder > Exporter les signets au format HTML...
hi: आयात और बैकअप > HTML में बुकमार्क निर्यात करें...
it: Importa e backup > Esporta segnalibri in HTML...
ja: インポートとバックアップ > ブックマークを HTML にエクスポート...

source: Add Search Scope
ar: إضافة نطاق بحث
fr: Ajouter une portée de recherche
hi: खोज क्षेत्र जोड़ें
it: Aggiungi ambito di ricerca
ja: 検索範囲を追加

source: Features
ar: الميزات
fr: Fonctionnalités
hi: विशेषताएँ
it: Funzionalità
ja: 機能

source: terms and privacy
ar: الشروط والخصوصية
fr: Conditions et confidentialité
hi: शर्तें और गोपनीयता
it: Termini e privacy
ja: 利用規約とプライバシー

source: Upgrade to
ar: ترقية إلى
fr: Passer à
hi: इसमें अपग्रेड करें
it: Passa a
ja: アップグレード

source: Thanks for going Pro
ar: شكرًا لاشتراكك في Pro
fr: Merci d'être passé Pro
hi: Pro में जाने के लिए धन्यवाद
it: Grazie per essere passato a Pro
ja: Pro 版をご利用いただきありがとうございます

source: Restore
ar: استعادة
fr: Restaurer
hi: बहाल करें
it: Ripristina
ja: 復元

source: Most Popular
ar: الأكثر شيوعًا
fr: Le plus populaire
hi: सबसे लोकप्रिय
it: Più popolare
ja: 一番人気

source: Active
ar: نشط
fr: Actif
hi: सक्रिय
it: Attivo
ja: 有効

source: %d-Day Trial
ar: تجربة لمدة %d يوم
fr: Essai de %d jours
hi: %d-दिन का परीक्षण
it: Prova di %d giorni
ja: %d 日間トライアル

source: Forever Pro
ar: Pro للأبد
fr: Pro pour toujours
hi: हमेशा के लिए Pro
it: Pro per sempre
ja: 永久 Pro

source: Upgrade to Pro
ar: ترقية إلى Pro
fr: Passer à Pro
hi: Pro में अपग्रेड करें
it: Passa a Pro
ja: Pro にアップグレード

source: Redemption
ar: استرداد
fr: Utilisation
hi: मोचन
it: Riscatto
ja: 引き換え

source: Contact
ar: اتصال
hi: संपर्क
it: Contatto
ja: お問い合わせ

source: Rate
ar: تقييم
fr: Noter
hi: रेट
it: Valuta
ja: 評価

source: Monthly
ar: شهري
fr: Mensuel
hi: मासिक
it: Mensile
ja: 月額

source: Yearly
ar: سنوي
fr: Annuel
hi: वार्षिक
it: Annuale
ja: 年額

source: Lifetime
ar: مدى الحياة
fr: À vie
hi: जीवनकाल
it: A vita
ja: 生涯

source: Redirecting to App Store...
ar: جاري التحويل إلى App Store...
fr: Redirection vers l'App Store...
hi: ऐप स्टोर पर पुनर्निर्देशित किया जा रहा है...
it: Reindirizzamento all'App Store...
ja: App Store にリダイレクトしています...

source: Settings...
ar: الإعدادات...
fr: Paramètres...
hi: सेटिंग्स...
it: Impostazioni...
ja: 設定...

source: More Apps
ar: المزيد من التطبيقات
fr: Plus d'applications
hi: और ऐप्स
it: Altre app
ja: その他のアプリ

source: Retry
ar: إعادة المحاولة
fr: Réessayer
hi: पुनः प्रयास करें
it: Riprova
ja: 再試行

source: No apps available
ar: لا توجد تطبيقات متاحة
fr: Aucune application disponible
hi: कोई ऐप उपलब्ध नहीं
it: Nessuna app disponibile
ja: 利用可能なアプリはありません

source: Toggle OneStep:
fr: Basculer OneStep :
